export const momentsData = [{
    "date": "2025-04-05",
    "time": "17:12",
    "content": "高速上有车抢救护车的应急车道，救护车被堵住了😅"
  },
  {
    "date": "2025-03-24",
    "time": "20:12",
    "content": "学校午餐惊现淋巴肉！"
  },
  {
    "date": "2025-03-20",
    "time": "20:44",
    "content": "忘说了，区级三好学生拿下了！"
  },
  {
    "date": "2025-03-20",
    "time": "18:21",
    "content": "咕咕咕了一个月，终于更新了！"
  },
  {
    "date": "2025-03-18",
    "time": "14:41",
    "content": "总感觉自己的网站比别人的难看！"
  },
  {
    date: "2025-08-06",
    time: "20:39",
    content: "第一条动态！别问为什么还有更早的，那些是从 VitePress 迁移过来的。"
  },
  {
    date: "2025-08-06",
    time: "23:04",
    content: "不要问虚线在哪里，因为有了那个以后动态就写不下了或者高度很奇怪，我不会写动态的高度。"
  },
  {
    date: "2025-08-06",
    time: "21:56",
    content: "羡慕后端。其实我之前网站是 VitePress 的时候用 Shell 写了个赤石科技，和后端功能差不多，最后才发现好像不如直接改文件好用（"
  },
  {
    date: "2025-08-07",
    time: "09:30",
    content: "电脑由于下雨进水了，具体情况请看最新文章。"
  },
  {
    date: "2025-08-08",
    time: "20:28",
    content: "在 GPT-5 的帮助下，我成功的给动态页加上了线。别问我为什么不是虚线，因为我觉得自带的太密了，难看。然后改成实线以后，我强迫症犯了，把归档也给改成这样了。还有一个小细节，如果第一条动态不能在一行内显示的话，旁边的线就会溢出，所以我拆分了一下动态。"
  },
  {
    date: "2025-08-08",
    time: "20:35",
    content: "有了这个功能以后我是一点也不想写文章，因为我写文章字数都很少，动态就可以满足我的需求了。"
  },
  {
    date: "2025-08-08",
    time: "20:38",
    content: "呜呜呜呜呜呜呜我要加友情链接羡慕你们"
  },
  {
    date: "2025-08-13",
    time: "08:58",
    content: "https://warn.qwq.blue/?url=https://lunars.site/links 防盗链小网站，自动把域名替换成正确的（这里是 https://qwq.blue/links），界面抄袭了一下 Google 新的登录界面。"
  },
  {
    date: "2025-08-16",
    time: "09:37",
    content: "由于个人原因，在 24 号之前我不会再更新了。"
  },
  {
    date: "2025-08-16",
    time: "09:40",
    content: "换了个头像，偷表情包的（"
  },
  {
    date: "2025-08-16",
    time: "10:42",
    content: "我想写日记，但是放博客里有点奇怪，而且可能存在负面内容，不然我开个分站（？"
  },
  {
    date: "2025-08-17",
    time: "09:40",
    content: "最后一日了。由于我是 Catppuccin 教，所以我尝试把这个网站也改成 Catppuccin 色调，但是失败了。"
  },
  {
    date: "2025-08-19",
    time: "21:04",
    content: "关于新的电脑坏了以后以为是主板问题寄走修发现什么问题也没有这件事。"
  },
  {
    date: "2025-08-24",
    time: "21:37",
    content: "孩子们我回来辣～"
  },
  {
    date: "2025-08-25",
    time: "18:49",
    content: "忘了给网站过生日了，那么让我们祝本站生日快乐🎂"
  },
  {
    date: "2025-08-26",
    time: "20:16",
    content: "上午写了一个基于 VitePress 的个人主页，有获取最新六篇文章和动态，自动获取 GitHub 最后 Commit 还有项目，然后技术栈和友情链接，反正这些自己没有的都是问的 GPT 从网站仓库获取后缓存的。然后发现 VitePress 是真的好看就又转成博客了，正在开发，但是明天开学了（"
  },
  {
    date: "2025-08-26",
    time: "21:43",
    content: "求求加个友链吧，你只需要用三分钟填写一个表就能自动添加了（见友链页面底部）。谢谢你。"
  }
]