export const postData = [
  {
    "fileName": "25-summer-holiday.md",
    "url": "/posts/25-summer-holiday",
    "title": "忆暑假",
    "description": "好忙的暑假呀。然后发现我整个暑假除了上课就体验地铁了（",
    "published": "2025-08-25T00:00:00.000Z",
    "content": "| 日期 | 事件 |\n| --- | --- |\n| 6.25 | 放假咯～ 🎉|\n| 6.28 | 上午打卡了天津一个风景很好的车站（陈塘庄），然后下午。作为一个天津人，没去过天津之眼是不行的，所以我就打算去那里。坐地铁到鼓楼站，然后公交！！！（第一次坐公交，等了二十分钟😭）回来的时候我就走回来了，也不远，比地铁公交快多了。|\n| 6.30 | 第一次去津静线，只有三个车厢，很小，而且只有四个车站，大概三十分钟就能坐一个来回。|\n| 7.1 | 体验 龙涵道～一号桥 站外连乘优惠，还买了杯蜜雪冰城的新饮品～ |\n| 7.2 | 下午本来打算出去玩的，一出通道，竟然是大雨，就回家了。|\n| 7.3 | 体验六号线二期（目前天津唯一一条自动驾驶线路！） |\n| 7.4 | 和平瞎逛，然后去万象城。|\n| 7.10 | 终于有时间去体验刚开的四北了。路上遇到了一个小地铁迷，到了小街以后，他们好像是直接上坐到西沽公园方向的了，然后又等了一趟。当时我在南仓站下车看了一会，（不得不说，南仓站真的特别好看。）等了两趟才等到西站的，然后到西沽公园又碰上了（|\n| 7.12 | 体验九号线地上段 |\n| 7.17 | 又体验了一次（|\n| 7.23 | 体验财经大学天地换乘！|\n| 7.28 | 去六纬路了，听说是天津最好看的地铁站。|\n| 8.7 | 本来应该是很普通的一天的，结果我早上起床发现电脑进水了，具体可以看一下那篇文章。|\n| 8.11 | 为了录 POV 又去了一次津静线。 |\n| 8.24 | 之前有一些个人事情要处理，所以哪里也没去。然后我去海河边跑了两公里来着。 |\n"
  },
  {
    "fileName": "bad-mood.md",
    "url": "/posts/bad-mood",
    "title": "DONOTREADME.md",
    "description": "瞎写别看，看了别骂，后果自负。",
    "published": "2025-09-06T00:00:00.000Z",
    "content": "在学校被欺负的事情。我不建议你看下去，因为可能会造成一些不良后果。如果还非要继续看的话就不要在评论区骂我。你要是不想看为啥还非要看？\n\n二月 | 初见端倪\n\nA 同学请我和 B 吃了根冰糖葫芦。转天我带了 30 想请他们吃顿好的，因为从来没人请我。然后发现 A 不在，所以我只能请 B 吃了。B 同学呢？看后面。\n\n三月 | 一个不愉快的生日\n\n一个不愉快的生日。之前同学们的生日我都攒了很多钱给他们买礼物。但是我过生日，我不想要礼物，我只是想让别人给我说句生日快乐。但是，一个人也没有。。。。其实这个还好，但是后面的事情就有点太过了。\n\n四月 | 辱骂\n\n放学的时候无意听见 A 和 B 在骂我，反正不说了，太脏了，说多了全是泪。其实这个月有很多更过分的事情，我忘了。也是这个时候在网上开始抱怨的吧，因为当时家里没人，现实里我也没朋友。\n\n五月 | 体育课\n\n班里没有朋友，体育课让和别人一起跳绳，没有任何人愿意和我跳，然后我自己跳绳。老师就过来说我，说我不跳绳，光在这里偷懒，然后罚了我在太阳下面跳了很多很多个，中暑了。A 和 B 就嘲笑我。回家哭对吧，我妈不让我哭，我爸不让我哭，体育老师不让我面无表情还有撇嘴，数学老师不让我笑。这是啥意思？我能啥表情？当时还在复习考很好的学校，但是没摇上考试机会，所以白复习了。\n\n六月 | 造谣\n\nA 和 B 一看到我就打我，然后在班里造谣，说我欠他们钱，说他们请我吃了好几百我就不请他们。。。我真的无语了。\n\n暑假 | 修养\n\n由于之前天天在网上说负面情绪，我也觉得不对，所以我把好友和群都删了。休息了两个月。对了，暑假两个月一直在上课。还有平常的周末我的课也堆满了。\n\n九月 | ？\n\n回群里看看，看到大家这么强，我自卑了，然后我就退了，被某些人说成“退群刷存在感”，但是这两天我并没有说过任何负面情绪还有我要存在感类似的话。道歉也没人理我。我很不理解了好吧。\n"
  },
  {
    "fileName": "bad-rain.md",
    "url": "/posts/bad-rain",
    "title": "论我的电脑是如何损坏的",
    "description": "前天晚上，天津下大雨了。当时我在睡觉，由于我睡觉都是不关窗户的，雨点吹到了我的身上。我除了惊讶，并没有发现什么其他的不对。",
    "published": "2025-08-08T00:00:00.000Z",
    "content": "晚上\n\n前天晚上，天津下大雨了。当时我在睡觉，由于我睡觉都是不关窗户的，雨点吹到了我的身上。\n我除了惊讶，并没有发现什么其他的不对。\n\n早上\n\n转天早上，我像往常一样，用手机附赠的卡针戳着电脑里面的开机按钮。\n为什么不直接开机？因为开机按钮坏了，只能这样了。\n往常我也最多戳个五六分钟，今天戳不开了。\n这时，我发现，主板有白色的痕迹，才意识到进水了。\n你可能会问，为什么你的电脑会进水？那不是还有壳子吗？\n答：由于那个迷你主机关着盖子根本戳不到里面，所以我为了方便，就给打开了。\n\n进水后\n\n我只好用着我的老电脑。我的老电脑很卡，一打开 VSCode + Chrome 就卡的要死。根本写不了东西。昨日晚上，我的母亲把暂时不用的那台电脑给我了，这才可以继续。你看到的这篇文章就是在这台电脑上写的。\n"
  },
  {
    "fileName": "beijing-one-day.md",
    "url": "/posts/beijing-one-day",
    "title": "北京一日游",
    "description": "忙了 62 天了，旅游一天不过分吧。",
    "published": "2025-08-31T00:00:00.000Z",
    "content": "高铁\n\n说到高铁，上次还是两年前呢。得益于家就在火车站的附近，所以我起床了一小会就能去。过了漫长的 35 分钟，终于到达北京南站了。听说北京也有磁悬浮，这不得体验一波？\n\n猎奇。\n\n下了火车，出站，终于发现北京南站为什么冬冷夏暖了。\n把空调外机放在出站口了！！！！！！！！！\n\n磁悬浮\n\n从北京南站在不坐四号线的情况下，可以在 14 号线的丽泽商务区转 16 号线，然后再转 6 号线到苹果园即可。上了磁悬浮，发现可我想象的不太一样，我以为是那种速度特别快的，但是实际上速度和普通的也差不了多少。\n\n清华大学\n\n预约要看手速，~~如果你玩音游的话请纵连~~。不得不说，清华真的环境很好，然后特别大。羡慕了。~~不知道能不能考上，就先不说我一定要去清华这种话了。~~\n\n前门\n\n抹茶冰激凌好吃😋，每次来都会吃。还路过了喝了豆汁的呕吐物。\n\n无人驾驶\n\n本来是体验 12 的，但是发现 19 和北京南站顺路而且也是自动驾驶，就从 8 号线换乘 12 号线再换乘 19 号线，这样都能体验到了。结果，12 号线不让人看，加挡板了，我也只能等一等 19 号线，看看是不是也这样了。但是，运气很好，19 号线竟然可以看，我就从起始站一直看到了终点站，然后再坐回去去换乘 14 到北京南了。回去的时候腿累了，看了看“商务座”，真的很好，香港那里的好像还要很多钱。但是差点赶不上火车了。😭。其实今天运气是很好，坐所有地铁都没等，清华也约上了。\n\n收获\n\n| 物品 | 数量 | 价格 |\n| ---- | ---- | ---- |\n| 清华大学明信片 | 1 | 0 元 |\n| 天津 → 北京南 车票 | 1 | 27 元 |\n| 北京南 → 天津 车票（打歪了！！！😭） | 1 | 27 元 |\n"
  },
  {
    "fileName": "blog-1-year.md",
    "url": "/posts/blog-1-year",
    "title": "博客预一周年",
    "description": "由于不知道写什么文章了，那就提前把一周年的文章写好吧，毕竟那个时候就不是现在的域名了。",
    "published": "2025-07-01T00:00:00.000Z",
    "content": "时间点记录\n\n其实关于里有了，既然是周年庆，那就再写一遍吧。\n| 📅 日期 / Date | 📖 事件 / Event |\n| --- | --- |\n| 2025.8.23 | 域名 lunars.site 到期 |\n| 2025.6.25 | 更换 Fuwari 主题 |\n| 2025.2.6 | 重建网站，并尝试自动搜索文章 |\n| 2024.10.21 | 重新搭建 VitePress 博客 |\n| 2024.10.4 | 使用 Gyoza (Astro) 主题重建博客 |\n| 2024.8.23 | 搭建基于 VitePress 的博客 |\n| 2024.8.23 | 购买域名 lunars.site |\n\n一些有趣的事情\n\n《使用命令行安装单系统 Arch Linux》🤔\n\n其实你看到的这篇文章早在去年 2 月就发布在了 bilibili 的专栏，主要是我当时嫌搭建博客麻烦，后来搭建完了就删除了。这篇文章被改版了三次，来看看唯一一个还保存的旧版（第二版）。\n\n《2024 年末总结》😨\n\n我觉得博客是给别人看自己的审美的，第二才是让大家看文章。\n我的博客长时间没人访问，都是爬虫机器人看的，大抵是因为文章太水吧。我并不在意文章。\n我为什么坚持？我相信，只要一个网站做到足够好，就会有人看的。我们走着瞧，只要努力，总有一天光明会来到的！\n谢谢正在看文章的你陪伴我和我的网站走过一天又一天。没有你，我的网站就不会有阳光。你也是，做事情一定要坚持下去。谢谢。♥️\n\n\\~~实际上我 2025 并没有更新什么文章，都是更新主题了~~，后面我尽量多更新点吧。\n\n《现在就 OK 了》😨\n\n原名：《在 Arch Linux 上安装输入法》。没错，这是我第二早的文章，专栏当时也发了这个。这个没有改版过，而是后面就删除了。当时写的文章还特别口语化。原文。\n\n《编程编久了胳膊有一点酸》😭\n\n我的电脑配置很垃圾，每次一打开 VSCode 内存就被跑满，甚至卡死。\n而且我是个懒人，我感觉用鼠标选来选去的太麻烦了，编程编久了胳膊有一点酸。\n在我了解 NeoVim 以后，感觉太炫酷了，我需要立马学习 Vim/NeoVim 。\n\n原名：《我决定从 VSCode 转到 NeoVim 了》。本文章纯属网站很久没更新凑出来的。原文。\n\n域名 😭\n\n买这个域名并不是有寓意，而是第一年 8 块，但是续费就得 200+ 了，所以我打算到期了买个新的。感觉这也是友情链接少的一个好处，不然你一更换域名都得找一遍。\n"
  },
  {
    "fileName": "good-zshell.md",
    "url": "/posts/good-zshell",
    "title": "和我一起配置 zsh 吧",
    "description": "刚装好的 Linux 终端不好看？zsh 助你一臂之力。本期教程将会教您如何配置 zsh (zinit)。",
    "published": "2025-06-30T00:00:00.000Z",
    "content": "安装\n\n你可以使用你的系统自带的包管理器安装 zsh，例如我是 Arch Linux，就可以输入这个来安装：\n\n刚安装好的是一个空壳，别着急，继续往下看。\n\n安装插件管理器 (zinit)\n\n你可以在你的 ~/.zshrc 文件中加入以下内容：\n\n然后重新读取一下配置文件：\n\n安装插件\n\n由于一个一个添加有点麻烦，所以我这里提供了一段代码：\n\n后面再加入插件只需要加到 LIGHT 中就可以了：\n\n\\[!WARNING]\n下面的东西必须放在上面的代码的前面，不然无法加载。\n\n推荐一些插件，是我自己正在用的：\n\n从 OMZ 中加载库\n\n同上，加入：\n\n\\[!WARNING]\n同上，下面的东西必须放在上面的代码的前面，不然无法加载。这些内容我都已经写好了，如果想自行配置，可以删除这些内容，自行添加。如果到现在还不清楚要写在哪里，请参考下方的“核对文件”部分。\n\n核对文件\n\n现在你的文件应该是这样的：\n\n当你再次进入 zsh 时，就会安装这些插件，然后你就……发现缺少了点什么？为什么我们的终端还是这么简陋啊喂！\n\nPrompt / 提示符\n\n是的，你觉得简陋的原因就是我们还没有配置 Prompt。\n\n这应该就是你现在的样子。等等，看了这么多教程的你，是不是以为又要装 powerlevel10k 了？这次来点不一样的。\n\n安装 starship\n\n如果你是 Arch Linux 用户，你可以直接用 pacman 安装它：\n\n如果你不是，请用这个命令安装：\n\n然后再在 ~/.zshrc 里添加这个来加载它：\n\n好了，你的终端变得好看了一点。如果你不满意这个提示符，可以去官网找到其他的主题。\n\n参考文件\n"
  },
  {
    "fileName": "inside-the-cable-temple.md",
    "url": "/posts/inside-the-cable-temple",
    "title": "《冀西南林路行》",
    "description": "终于有空听万青的新专辑了，去年最喜欢听万青了。",
    "published": "2025-08-26T00:00:00.000Z",
    "content": "万青不是听腻了吗？\n\n是，然后我去听 Beyond，听了半年也听腻了，才来找新的好听的，然后看 B 站就发现这张专辑了。感觉万青所有音乐都很好听，新的肯定也差不了，所以——\n\n《河北墨麒麟》\n\n试试 冰冷昂贵入云涉水的轻身术\n看看 演员王公游民盗贼的心电图\n\n这是我听过最长的一首歌了。由于它不要钱，所以我很久以前就听了。当时我那网易云还有 SVIP，看到有一个音质下载下来是六百兆的，我就下了，结果发现和正常的没什么区别。\n\n要钱\n\n\\[!WARNING]\n不要学作者，请支持正版。\n\nemmm网易云的整个专辑要给钱才能听，那我们没钱的怎么办？对，~~B 站启动~~。\n想到之前改过一个 B 站视频下载脚本，就用那个搞下来以后用 ffmpeg 转成 mp3 听了。\n\n《早（纯音乐）》《泥河》\n\n高地奔流 掠山光过太行\n平原午休 纵鱼儿跃夕阳\n\n不得不说，我听全长版的时候那个衔接是真的好。然后《泥河》是我整张专辑里最喜欢的了。\n"
  },
  {
    "fileName": "install-archlinux.md",
    "url": "/posts/install-archlinux",
    "title": "使用命令行安装单系统 Arch Linux",
    "description": "论加入 Arch 教的第一步——安装",
    "published": "2025-02-25T00:00:00.000Z",
    "content": "检查\n\n你的电脑支持 UEFI 启动。\n\n你的电脑已经关闭安全启动。\n\n你拥有 Linux 基础。\n\n好的心态 😉\n\n\\[!NOTE]\n如果您在安装过程中遇到问题，请尝试使用搜索引擎搜索问题或者查阅 Arch Wiki，最好不要询问他人。\n\n\\[!WARNING]\n您硬盘上的所有信息将会被抹除，所以请提前备份，如出现数据丢失等情况，后果自负。\n\n准备\n\n一个 Arch Linux 镜像。\n\n使用写盘工具将镜像文件写入你的 USB。\n\n准备好后，请从 USB 中启动您的 Arch Linux ISO。进入 Grub 引导界面选择后请第一个。\n\n连网\n\n这一步仅限使用 WLAN 连接网络的设备需要操作。如果你已经使用网线连接了网络，请跳过这一步。\n\n我们可以使用 iwctl 命令连接网络。\n\n然后，你需要测试是否已经连接网络。\n\n出现类似以上的持续输出后可以按下 Ctrl+C 结束。\n\n换源\n\n在此之前，请先禁用 Reflector，因为 Reflector 可能会更新你的 mirrorlist 文件。\n\n删掉 mirrorlist 文件。\n\n然后就可以更换了，你需要输入以下内容使用 vim 编辑器打开。\n\n请在此加入以下内容：\n\n完成后请按下 ESC 并输入 :wq，回车。\n\n分区\n\n在分区之前，你需要查看你磁盘的编号。\n\n你会看到一个或者多个 Disk /dev/\\* 等磁盘，请查看磁盘的分区或磁盘大小来辨别你要安装的磁盘。例如我的电脑，就只有一个磁盘： /dev/nvme0n1。在你辨别完成后，记住你的磁盘编号，然后输入：\n\n你就会看到一个界面\n\n你需要删除所有的分区。选中分区后选择第一个DELETE，直到你的设备一栏里只剩余 Free Space。\n\n你需要选中 Free Space，然后选择 Create，分区大小修改为1G，然后选择 Type，找到第一个，EFI，选中。这个分区在后面会被称之为 EFI 分区。请记住它是 /dev/\\*\\*\\*。\n\n继续把光标放在 Free Space 上，直接回车，然后选择 Write ，输入y后，你的磁盘就完成分区了。这个分区在后面会被称之为系统分区。请记住它是 /dev/\\*\\*\\*。\n\n创建文件系统\n\n你需要做的就是（创建 EFI 分区的文件系统、）创建系统分区的文件系统，然后创建一些子卷，最后挂载。你可以按照下面的命令操作。\n\n安装基本系统\n\n使用如下命令更新 Keyring 以及安装基本软件包到你的分区。这一步的速度和你的网速有关，可能会持续 5 分钟左右。\n\n完成后，输入以下命令将你现在挂载的位置写入你系统中的 fstab。\n\n你还需要输入以下命令检验你的 fstab 中是否存在子卷 ID。\n\n如果这一步执行后存在输出，请立刻使用编辑器删除类似 subvolid=xxx 这样的字符。记得同时删除后面的逗号。\n\n完成后请按下 ESC 并输入 :wq，回车。\n\n配置\n\n给新系统换源\n\n切换到系统\n\n主机名称\n\n输入下面的命令设置你电脑的名字（不要出现除了\"-\"的符号）。例如我的电脑叫 Silver：\n\nHosts\n\n打开 /etc/hosts：\n\n请使用编辑器加入以下内容：\n\n完成后请按下 ESC 并输入 :wq，回车。\n\n语言支持\n\n执行以下命令添加中文以及英文的支持，并将默认语言设置为英语：\n\n\\[!NOTE]\n如果你想问为什么不设置中文，答案是你的终端里没有中文字符的支持，即使直接安装了桌面环境也不行，因为你没有安装中文字体。\n\n使用编辑器打开 /etc/locale.gen\n\n在文件内找到以下内容：\n\n按下 i 键打开编辑模式，找到 #，用光标对准其后方，然后把它删掉，以此类推。编辑完后，请按下 ESC，然后输入 :wq 回车来退出。\n\n生成语言支持\n\n设置系统语言\n\n\\[!TIP]\n现在不能设置中文是因为终端内无法查看中文字符，请在安装完桌面环境和中文字体后再修改语言。\n\n时区\n\n使用这条命令设置为上海时间（UTC+8）。\n\n同步到硬件时间。\n\nRoot 的密码\n\n当你执行下面的命令后会让你设置 Root 的密码。输入的字符不会显示。\n\n安装 Plasma 桌面（可选）\n\n这会同时安装中文字体。\n\n开机启动网络管理器\n\n添加用户\n\n你还需要拥有 sudo 的权限：\n\n完成后请按下 ESC 并输入 :wq，回车。\n\n安装微码\n\n配置引导\n\n使用下列命令安装软件：\n\n使用下列命令安装引导器：\n\n允许发现其他系统：\n\n打开后去掉最后一行前面的 #，完成后请按下 ESC 并输入 :wq，回车。\n\n生成配置文件：\n\n设置为中文\n\n如果您在前面安装了 Plasma 桌面以及 SDDM，那么现在你就可以把系统切换为中文了。\n\n最后一步\n\n你需要退出 Chroot 并且重启。\n\n大功告成\n\n恭喜你，成功的安装了 Arch Linux。\n"
  },
  {
    "fileName": "use-fuwari-theme.md",
    "url": "/posts/use-fuwari-theme",
    "title": "关于为什么我会换到 Fuwari 主题",
    "description": "我放弃了我自己写了好几个月的 VitePress 主题，迁移到了 Fuwari。",
    "published": "2025-06-29T00:00:00.000Z",
    "content": "由于看到 Pinpe 的这篇文章，我也想换到 Fuwari 了。在考虑了我的网站已经烂透了，很多文件的代码都重复（例如标签和分类页面，他们都是除了一些类名都是完全一样的，每次改 CSS 的时候都特别麻烦），便有了你现在看到的这个网站。\n\n我从 GitHub 下载 Fuwari 主题后，配置完了，正想迁移友情链接时，才得知 Fuwari 原版主题没有这个功能。参考了熔岩墨迹网站并下载后，我把我的配置文件复制了上去，做了一些小更改，就差不多完工了。我后悔没有早点发现 Fuwari。~~你肯定很想知道为什么我迁移得这么快，因为我只有一篇文章，剩下的有点黑历史，就删掉了。~~\n"
  },
  {
    "fileName": "what-is-arch.md",
    "url": "/posts/what-is-arch",
    "title": "Arch Linux 是什么？",
    "description": "Arch Linux 是一种通用操作系统，它是基于 x86-64 架构的一类 GNU/Linux 发行版。",
    "published": "2025-09-03T00:00:00.000Z",
    "content": "Arch Linux 是一种通用操作系统，它是基于 x86-64 架构的一类 GNU/Linux 发行版。\n\nArch Linux 采用滚动升级模式，尽全力为使用者提供最新的稳定版软件。初始安装完成的 Arch Linux 只是一个基本系统，随后用户可以根据自己的喜好安装需要的软件并配置成符合自己理想的个性化系统。\n\n核心原则\n\n以下核心原则构成了我们通常所指的 Arch 之道，或者说 Arch 的哲学。或许最好的结词是 Keep It Simple, Stupid（对应中文为“保持简单，且一目了然”）。\n\n简洁\n\nArch Linux 将简洁定义为：避免任何不必要的添加、修改和复杂化的增加。它提供的软件包都来自原始开发者（以下简称上游），且仅进行和本发行版（以下简称下游）相关的最小修改版本。\n\n不包含上游不愿意接受的补丁。绝大部分 Arch 下游补丁都已经被上游接受，会在下一个正式版本里被包含。\n\n配置文件也是来自上游，它仅包含发行版必须的调整，比如特殊的文件系统路径变动。Arch Linux 不会在安装一个软件包后就自动启动软件包的服务。\n\n软件包通常都和一个上游项目直接对应。仅在极少数情况下才会拆分软件包。\n\n官方不支持图形化配置界面，建议用户使用命令行或文本编辑器修改设置。\n\n现代化\n\nArch Linux 尽全力使软件处于最新的稳定版本，只要没有出现系统软件包损坏，都会尽量使用最新版本的软件包。\n\nArch Linux 采用滚动更新的方式，安装之后可以通过命令持续更新系统与软件包。\n\nArch Linux 向 GNU/Linux 用户提供了许多新特性，包括 systemd 初始化系统、现代化的文件系统、LVM2/EVMS、软件磁盘阵列（软 RAID）、udev 支持、initcpio（附带 mkinitcpio）以及最新的 Linux 内核。\n\n实用性\n\nArch Linux 注重实用性，且尽力避免意识形态之争。最终的设计决策都是由开发者之间的共识决定，开发者依赖基于客观事实的技术分析和讨论，避免国家之间和政治因素的影响，不被世俗流行观点左右。\n\nArch Linux 的仓库中包含大量的软件包和编译脚本。用户可以按照需要进行自由选择。仓库中既提供了开源、自由的软件，也提供了闭源软件。即实用性大于意识形态。\n\n以用户为中心\n\n许多 Linux 发行版都试图变得更加“用户友好”，Arch Linux 则一直是，且永远会是“以用户为中心”。本发行版是为了满足贡献者的需求，而不是为了吸引尽可能多的用户。\n\nArch Linux 适用于乐于自己动手的用户，因为他们往往更愿意花时间阅读文档，解决自己的问题。\n\nArch Linux 鼓励每一个用户参与和贡献，报告和帮助修复 bugs，提供软件包补丁和参加核心项目：Arch 开发者都是志愿者，通过持续的贡献成为团队中的一员。Archers 可以自行贡献软件包到 Arch 用户仓库，提升 ArchWiki 文档质量，在论坛、邮件列表或者 IRC 中给其它用户提供技术支持。\n\nArch Linux 现在是全球许多 GNU/Linux 用户的选择，已经有许多国际社区提供帮助和文档的翻译。\n\n通用性\n\nArch Linux 作为一种通用 Linux 发行版，它的初始安装仅提供命令行环境：用户不需要删除大量不需要的软件包，而是可以从官方软件仓库成千上万的高质量软件包中进行选择，并搭建自己的系统。目前支持 x86-64 架构。（对 i686 架构的支持已经结束）\n\nArch Linux 使用 Pacman 包管理系统实现系统和软件包的滚动升级。并且 Arch Linux 还提供一个类似 ports 的包构建系统（Arch Build System），通过它可以轻松从源码构建和安装软件包，并用一个命令完成同步。您甚至可以用一个命令重新构建整个系统。Arch 还提供 Arch 用户仓库，它包含了成千上万个由用户自行维护的 PKGBUILD 脚本，配合 makepkg 工具，从编译到打包一气呵成。用户还能轻松构建和维护属于自己的自定义软件源。\n\n历史沿革\n\n这些年来，Arch 社区不断成长，最近也收到了大量的关注和评论。\n\n除少数特例以外，Arch Linux 的开发者大部分是不收工资的志愿者与爱好者，目前也并没有通过 Arch Linux 赚钱的计划。Arch Linux 开发的详细历史可以浏览 Arch 部分和 Arch Linux 新闻存档及 Arch Linux CN 首页上的中文版新闻列表。\n\n早期\n\n加拿大程序员、吉他手 Judd Vinet 从 2001 年早期开始开发 Arch Linux ，并在 2002 年 3 月 11 日正式发行 0.1 版。他受到 Slackware、BSD、PLD Linux 和 CRUX 的启发，但在当时这些发行版普遍缺少软件包管理工具。所以 Vinet 同样以简洁为原则建立了这个发行版，并编写了 Pacman 软件包，自动处理软件包的依赖解析、安装、删除和更新。\n\n中期\n\n这个图表见证了Arch Linux 社区的稳步扩大。而且从早期开始，Arch 就树立起了开放、友好和社区互助的形象。\n\nArchWiki 的诞生\n\n2005 年 7 月 8 日，用 MediaWiki 搭建的 ArchWiki 开始运行。\n\nA. Griffin 时代\n\n2007 年下半年，Judd Vinet 退出了 Arch Linux 的开发，并把领导权交给美国程序员 Aaron Griffin，也就是 Phrakture，目前他依然是 Arch Linux 开发者。\n\nArch 安装脚本\n\n在 2012 年 7 月的 Arch Linux 安装介质中弃用了基于菜单的\"Arch 安装框架\"（AIF），改为使用\"Arch 安装脚本\"（arch-install-scripts）。\n\nSystemd 时代\n\n2012 到 2013 年间， Arch 用 Systemd 替换了 System V init。\n\n抛弃 i686 支持\n\n鉴于在开发者和社区中对 i686 架构的使用程度逐渐式微，Arch Linux 对 i686 的支持已经于2017年11月底被抛弃。\n\n选举项目的领导角色\n\n2020 年初，Arch 开始用新的流程选择未来的领袖，详情记载在 DeveloperWiki: Project Leader。\n\nAaron Griffin 决定不再担任项目领导，因此 Arch 通过选举方式正式确认 Levente Polyak 为新的领导。\n\nGitLab 时代\n\n2023 年 5 月，Arch Linux 将其打包基础设施迁移到 GitLab。除了内部更改和创新外，这也导致将 testing 仓库拆分为 core-testing 和 extra-testing，将 staging 仓库拆分为 core-staging 和 extra-staging，最后 community 已合并至 extra。\n\n几个月后，即 2023 年 11 月，旧的错误跟踪器（Flyspray）已迁移到 GitLab，其协作功能（问题和合并请求）已向公众开放。因为存档问题，保留一个旧错误跟踪器的静态副本，以保证链接仍然有效。\n"
  }
] as const;
